test/LoadTest/orionPerformanceOnlyAppends_v2.0.jmx
<?xml version="1.0" encoding="UTF-8"?>
<!--
 Copyright 2014 Telefonica Investigacion y Desarrollo, S.A.U

 This file is part of Orion Context Broker.

 Orion Context Broker is free software: you can redistribute it and/or
 modify it under the terms of the GNU Affero General Public License as
 published by the Free Software Foundation, either version 3 of the
 License, or (at your option) any later version.

 Orion Context Broker is distributed in the hope that it will be useful,
 but WITHOUT ANY WARRANTY; without even the implied warranty of
 MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU Affero
 General Public License for more details.

 You should have received a copy of the GNU Affero General Public License
 along with Orion Context Broker. If not, see http://www.gnu.org/licenses/.

 For those usages not covered by this license please contact with
 iot_support at tid dot es
 
 Author: Ivan Arias 
-->
<jmeterTestPlan version="1.2" properties="2.6" jmeter="2.11 r1554548">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Orion Performance Test" enabled="true">
      <stringProp name="TestPlan.comments">Script to validate the indexes with  random queries </stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="Variables definidas por el Usuario" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="General Settings" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="outputDir" elementType="Argument">
            <stringProp name="Argument.name">outputDir</stringProp>
            <stringProp name="Argument.value">/tmp/JMeter_result/result_${__time(YMDHMS,)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
            <stringProp name="Argument.desc">output csv path</stringProp>
          </elementProp>
          <elementProp name="PROJECT" elementType="Argument">
            <stringProp name="Argument.name">PROJECT</stringProp>
            <stringProp name="Argument.value">${__P(PROJECT,DEFAULT)}</stringProp>
            <stringProp name="Argument.desc">Project name to upload results</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="TEST_NAME" elementType="Argument">
            <stringProp name="Argument.name">TEST_NAME</stringProp>
            <stringProp name="Argument.value">${__P(TEST_NAME,IndexTest)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
            <stringProp name="Argument.desc">test name</stringProp>
          </elementProp>
          <elementProp name="RUNTIME" elementType="Argument">
            <stringProp name="Argument.name">RUNTIME</stringProp>
            <stringProp name="Argument.value">${__P(RUNTIME,3)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
            <stringProp name="Argument.desc">test time </stringProp>
          </elementProp>
          <elementProp name="THREADS" elementType="Argument">
            <stringProp name="Argument.name">THREADS</stringProp>
            <stringProp name="Argument.value">${__P(THREADS,1)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
            <stringProp name="Argument.desc">threads number</stringProp>
          </elementProp>
          <elementProp name="RAMPUP" elementType="Argument">
            <stringProp name="Argument.name">RAMPUP</stringProp>
            <stringProp name="Argument.value">${__P(RAMPUP,0)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
            <stringProp name="Argument.desc">rampup threads</stringProp>
          </elementProp>
          <elementProp name="ITERATIONS" elementType="Argument">
            <stringProp name="Argument.name">ITERATIONS</stringProp>
            <stringProp name="Argument.value">${__P(ITERATIONS,1)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
            <stringProp name="Argument.desc">iterations number</stringProp>
          </elementProp>
          <elementProp name="HOST" elementType="Argument">
            <stringProp name="Argument.name">HOST</stringProp>
            <stringProp name="Argument.value">${__P(HOST,127.0.0.1)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
            <stringProp name="Argument.desc">main host or balancer </stringProp>
          </elementProp>
          <elementProp name="PORT" elementType="Argument">
            <stringProp name="Argument.name">PORT</stringProp>
            <stringProp name="Argument.value">${__P(PORT,1026)}</stringProp>
            <stringProp name="Argument.desc">[ 1026 / 80 ] CB port</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="MON_PORT" elementType="Argument">
            <stringProp name="Argument.name">MON_PORT</stringProp>
            <stringProp name="Argument.value">${__P(MON_PORT,3450)}</stringProp>
            <stringProp name="Argument.desc">[3450-4444] Monitor Perf Port</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="LOADOSOPHIA" elementType="Argument">
            <stringProp name="Argument.name">LOADOSOPHIA</stringProp>
            <stringProp name="Argument.value">loadosophia_upload_token</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
            <stringProp name="Argument.desc">loadosophia token</stringProp>
          </elementProp>
        </collectionProp>
      </Arguments>
      <hashTree/>
      <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="Request Variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="MAXAPPENDS" elementType="Argument">
            <stringProp name="Argument.name">MAXAPPENDS</stringProp>
            <stringProp name="Argument.value">${__P(MAXAPPENDS,40000)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
            <stringProp name="Argument.desc">maximum number of entities documents in DB</stringProp>
          </elementProp>
          <elementProp name="REALMAXAPPEND" elementType="Argument">
            <stringProp name="Argument.name">REALMAXAPPEND</stringProp>
            <stringProp name="Argument.value">100</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="UPDATEPATH" elementType="Argument">
            <stringProp name="Argument.name">UPDATEPATH</stringProp>
            <stringProp name="Argument.value">/NGSI10/updateContext</stringProp>
            <stringProp name="Argument.desc">update request path</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="QUERYPATH" elementType="Argument">
            <stringProp name="Argument.name">QUERYPATH</stringProp>
            <stringProp name="Argument.value">/NGSI10/queryContext</stringProp>
            <stringProp name="Argument.desc">query request path</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="entityType" elementType="Argument">
            <stringProp name="Argument.name">entityType</stringProp>
            <stringProp name="Argument.value">Room</stringProp>
            <stringProp name="Argument.desc">entity type</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="entityId" elementType="Argument">
            <stringProp name="Argument.name">entityId</stringProp>
            <stringProp name="Argument.value">Room1_</stringProp>
            <stringProp name="Argument.desc">entity Id + counter + 0. EJ: Room1_450</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </Arguments>
      <hashTree/>
      <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
        <collectionProp name="HeaderManager.headers">
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">Content-Type</stringProp>
            <stringProp name="Header.value">application/xml</stringProp>
          </elementProp>
        </collectionProp>
      </HeaderManager>
      <hashTree/>
      <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults" enabled="true">
        <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
          <collectionProp name="Arguments.arguments"/>
        </elementProp>
        <stringProp name="HTTPSampler.domain">${HOST}</stringProp>
        <stringProp name="HTTPSampler.port">${PORT}</stringProp>
        <stringProp name="HTTPSampler.protocol">http</stringProp>
        <stringProp name="HTTPSampler.contentEncoding">utf-8</stringProp>
        <stringProp name="HTTPSampler.implementation">HttpClient4</stringProp>
        <stringProp name="HTTPSampler.concurrentPool">4</stringProp>
      </ConfigTestElement>
      <hashTree/>
      <RandomVariableConfig guiclass="TestBeanGUI" testclass="RandomVariableConfig" testname="Random PRESS" enabled="true">
        <stringProp name="maximumValue">555</stringProp>
        <stringProp name="minimumValue">000</stringProp>
        <boolProp name="perThread">true</boolProp>
        <stringProp name="randomSeed">100</stringProp>
        <stringProp name="variableName">PRESS</stringProp>
      </RandomVariableConfig>
      <hashTree/>
      <RandomVariableConfig guiclass="TestBeanGUI" testclass="RandomVariableConfig" testname="Random TEMP" enabled="true">
        <stringProp name="maximumValue">999</stringProp>
        <stringProp name="minimumValue">111</stringProp>
        <boolProp name="perThread">true</boolProp>
        <stringProp name="randomSeed">50</stringProp>
        <stringProp name="variableName">TEMP</stringProp>
      </RandomVariableConfig>
      <hashTree/>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="APPENDS" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Controlador Bucle" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">${ITERATIONS}</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">${THREADS}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${RAMPUP}</stringProp>
        <longProp name="ThreadGroup.start_time">1373439867000</longProp>
        <longProp name="ThreadGroup.end_time">1373439867000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <RunTime guiclass="RunTimeGui" testclass="RunTime" testname="Runtime Controller" enabled="true">
          <stringProp name="RunTime.seconds">${RUNTIME}</stringProp>
        </RunTime>
        <hashTree>
          <BeanShellPreProcessor guiclass="TestBeanGUI" testclass="BeanShellPreProcessor" testname="Random Counter" enabled="true">
            <boolProp name="resetInterpreter">false</boolProp>
            <stringProp name="script">
//libraries
import java.util.*;


// constants
maxAppends=vars.get(&quot;MAXAPPENDS&quot;);
rnd = new Random();

//begin
realMaxAppend=Integer.valueOf(maxAppends) * 10;
counter= rnd.nextInt(realMaxAppend);
vars.put(&quot;COUNTER&quot;,counter.toString());


</stringProp>
          </BeanShellPreProcessor>
          <hashTree/>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Append Request" enabled="true">
            <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments">
                <elementProp name="" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF-8&quot;?&gt;&#xd;
    &lt;updateContextRequest&gt;&#xd;
        &lt;contextElementList&gt;&#xd;
            &lt;contextElement&gt;&#xd;
                &lt;entityId type=&quot;${entityType}&quot; isPattern=&quot;false&quot;&gt; &#xd;
                    &lt;id&gt;${entityId}${COUNTER}&lt;/id&gt; &#xd;
                &lt;/entityId&gt;&#xd;
                &lt;contextAttributeList&gt; &#xd;
                    &lt;contextAttribute&gt;&#xd;
                        &lt;name&gt;temperature&lt;/name&gt;&#xd;
                        &lt;type&gt;centigrade&lt;/type&gt; &#xd;
                        &lt;contextValue&gt;${TEMP}&lt;/contextValue&gt;&#xd;
                    &lt;/contextAttribute&gt;&#xd;
                    &lt;contextAttribute&gt;&#xd;
                        &lt;name&gt;pressure&lt;/name&gt;&#xd;
                        &lt;type&gt;mmHg&lt;/type&gt; &#xd;
                        &lt;contextValue&gt;${PRESS}&lt;/contextValue&gt;&#xd;
                    &lt;/contextAttribute&gt;&#xd;
               &lt;/contextAttributeList&gt;&#xd;
          &lt;/contextElement&gt;&#xd;
     &lt;/contextElementList&gt;&#xd;
     &lt;updateAction&gt;APPEND&lt;/updateAction&gt;&#xd;
&lt;/updateContextRequest&gt;</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
            <stringProp name="HTTPSampler.path">${UPDATEPATH}</stringProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
            <boolProp name="HTTPSampler.monitor">false</boolProp>
          </HTTPSamplerProxy>
          <hashTree>
            <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Response Code/Reason" enabled="true">
              <collectionProp name="Asserion.test_strings">
                <stringProp name="-1978490527">&lt;code&gt;200&lt;/code&gt;</stringProp>
                <stringProp name="-1935280275">&lt;reasonPhrase&gt;OK&lt;/reasonPhrase&gt;</stringProp>
              </collectionProp>
              <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
              <boolProp name="Assertion.assume_success">false</boolProp>
              <intProp name="Assertion.test_type">2</intProp>
            </ResponseAssertion>
            <hashTree/>
          </hashTree>
        </hashTree>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="UPDATES" enabled="false">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Controlador Bucle" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">${ITERATIONS}</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">${THREADS}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${RAMPUP}</stringProp>
        <longProp name="ThreadGroup.start_time">1373439867000</longProp>
        <longProp name="ThreadGroup.end_time">1373439867000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <RunTime guiclass="RunTimeGui" testclass="RunTime" testname="Runtime Controller" enabled="true">
          <stringProp name="RunTime.seconds">${RUNTIME}</stringProp>
        </RunTime>
        <hashTree>
          <RandomVariableConfig guiclass="TestBeanGUI" testclass="RandomVariableConfig" testname="Random variable" enabled="true">
            <stringProp name="maximumValue">${MAXAPPENDS}</stringProp>
            <stringProp name="minimumValue">1</stringProp>
            <boolProp name="perThread">false</boolProp>
            <stringProp name="variableName">COUNTER</stringProp>
          </RandomVariableConfig>
          <hashTree/>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Update Request" enabled="true">
            <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments">
                <elementProp name="" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF-8&quot;?&gt;&#xd;
    &lt;updateContextRequest&gt;&#xd;
        &lt;contextElementList&gt;&#xd;
            &lt;contextElement&gt;&#xd;
                &lt;entityId type=&quot;${entityType}&quot; isPattern=&quot;false&quot;&gt; &#xd;
                    &lt;id&gt;${entityId}${COUNTER}0&lt;/id&gt; &#xd;
                &lt;/entityId&gt;&#xd;
                &lt;contextAttributeList&gt; &#xd;
                    &lt;contextAttribute&gt;&#xd;
                        &lt;name&gt;temperature&lt;/name&gt;&#xd;
                        &lt;type&gt;centigrade&lt;/type&gt; &#xd;
                        &lt;contextValue&gt;${TEMP}&lt;/contextValue&gt;&#xd;
                    &lt;/contextAttribute&gt;&#xd;
                    &lt;contextAttribute&gt;&#xd;
                        &lt;name&gt;pressure&lt;/name&gt;&#xd;
                        &lt;type&gt;mmHg&lt;/type&gt; &#xd;
                        &lt;contextValue&gt;${PRESS}&lt;/contextValue&gt;&#xd;
                    &lt;/contextAttribute&gt;&#xd;
               &lt;/contextAttributeList&gt;&#xd;
          &lt;/contextElement&gt;&#xd;
     &lt;/contextElementList&gt;&#xd;
     &lt;updateAction&gt;UPDATE&lt;/updateAction&gt;&#xd;
&lt;/updateContextRequest&gt;</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
            <stringProp name="HTTPSampler.path">${UPDATEPATH}</stringProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
            <boolProp name="HTTPSampler.monitor">false</boolProp>
          </HTTPSamplerProxy>
          <hashTree>
            <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Response Code/Reason" enabled="true">
              <collectionProp name="Asserion.test_strings">
                <stringProp name="-1978490527">&lt;code&gt;200&lt;/code&gt;</stringProp>
                <stringProp name="-1935280275">&lt;reasonPhrase&gt;OK&lt;/reasonPhrase&gt;</stringProp>
              </collectionProp>
              <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
              <boolProp name="Assertion.assume_success">false</boolProp>
              <intProp name="Assertion.test_type">2</intProp>
            </ResponseAssertion>
            <hashTree/>
          </hashTree>
        </hashTree>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="QUERIES" enabled="false">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Controlador Bucle" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">${ITERATIONS}</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">${THREADS}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${RAMPUP}</stringProp>
        <longProp name="ThreadGroup.start_time">1373439867000</longProp>
        <longProp name="ThreadGroup.end_time">1373439867000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <RunTime guiclass="RunTimeGui" testclass="RunTime" testname="Runtime Controller" enabled="true">
          <stringProp name="RunTime.seconds">${RUNTIME}</stringProp>
        </RunTime>
        <hashTree>
          <RandomVariableConfig guiclass="TestBeanGUI" testclass="RandomVariableConfig" testname="Random variable" enabled="true">
            <stringProp name="maximumValue">${MAXAPPENDS}</stringProp>
            <stringProp name="minimumValue">1</stringProp>
            <boolProp name="perThread">false</boolProp>
            <stringProp name="variableName">COUNTER</stringProp>
          </RandomVariableConfig>
          <hashTree/>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="query request" enabled="true">
            <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments">
                <elementProp name="" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">false</boolProp>
                  <stringProp name="Argument.value">&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF-8&quot;?&gt;&#xd;
&lt;queryContextRequest&gt;&#xd;
    &lt;entityIdList&gt;&#xd;
        &lt;entityId type=&quot;${entityType}&quot; isPattern=&quot;false&quot;&gt; &#xd;
            &lt;id&gt;${entityId}${COUNTER}0&lt;/id&gt;&#xd;
        &lt;/entityId&gt;&#xd;
    &lt;/entityIdList&gt;&#xd;
    &lt;attributeList&gt;&#xd;
    &lt;/attributeList&gt;&#xd;
&lt;/queryContextRequest&gt;</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
            <stringProp name="HTTPSampler.path">${QUERYPATH}</stringProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
            <boolProp name="HTTPSampler.monitor">false</boolProp>
          </HTTPSamplerProxy>
          <hashTree>
            <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Response Code/Reason" enabled="true">
              <collectionProp name="Asserion.test_strings">
                <stringProp name="-1978490527">&lt;code&gt;200&lt;/code&gt;</stringProp>
                <stringProp name="-1935280275">&lt;reasonPhrase&gt;OK&lt;/reasonPhrase&gt;</stringProp>
              </collectionProp>
              <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
              <boolProp name="Assertion.assume_success">false</boolProp>
              <intProp name="Assertion.test_type">2</intProp>
            </ResponseAssertion>
            <hashTree/>
          </hashTree>
        </hashTree>
      </hashTree>
      <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <stringProp name="filename">${outputDir}/AggregateReport__${__time(YMDHMS,)}_IP_${HOST}_x${THREADS}Threads_x${RUNTIME}Sec.csv</stringProp>
      </ResultCollector>
      <hashTree/>
      <kg.apc.jmeter.perfmon.PerfMonCollector guiclass="kg.apc.jmeter.vizualizers.PerfMonGui" testclass="kg.apc.jmeter.perfmon.PerfMonCollector" testname="PerfMon Collector" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <longProp name="interval_grouping">1000</longProp>
        <boolProp name="graph_aggregated">false</boolProp>
        <collectionProp name="metricConnections">
          <collectionProp name="-1629844088">
            <stringProp name="1180709214">${HOST}</stringProp>
            <stringProp name="-1152144878">${MON_PORT}</stringProp>
            <stringProp name="66952">CPU</stringProp>
          </collectionProp>
          <collectionProp name="364408887">
            <stringProp name="1180709214">${HOST}</stringProp>
            <stringProp name="-1152144878">${MON_PORT}</stringProp>
            <stringProp name="-1993889503">Memory</stringProp>
          </collectionProp>
          <collectionProp name="351529034">
            <stringProp name="1180709214">${HOST}</stringProp>
            <stringProp name="-1152144878">${MON_PORT}</stringProp>
            <stringProp name="82881">TCP</stringProp>
          </collectionProp>
        </collectionProp>
      </kg.apc.jmeter.perfmon.PerfMonCollector>
      <hashTree/>
      <kg.apc.jmeter.reporters.LoadosophiaUploader guiclass="kg.apc.jmeter.reporters.LoadosophiaUploaderGui" testclass="kg.apc.jmeter.reporters.LoadosophiaUploader" testname="Loadosophia report" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
        <stringProp name="project">${PROJECT}</stringProp>
        <stringProp name="uploadToken">${LOADOSOPHIA}</stringProp>
        <stringProp name="storeDir">${outputDir}</stringProp>
        <stringProp name="color">green</stringProp>
        <stringProp name="title">${__time(YMD)}_${TEST_NAME}_${THREADS}_x${RUNTIME}Secs_IP-${HOST}</stringProp>
        <boolProp name="useOnline">true</boolProp>
      </kg.apc.jmeter.reporters.LoadosophiaUploader>
      <hashTree/>
      <ResultCollector guiclass="MonitorHealthVisualizer" testclass="ResultCollector" testname="Monitor Results" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="Requests/Responses Errors " enabled="true">
        <boolProp name="ResultCollector.error_logging">true</boolProp>
        <stringProp name="filename">${outputDir}/Errors__${__time(YMDHMS,)}_IP_${HOST}_x${THREADS}Threads_x${RUNTIME}Sec.csv</stringProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>